[
  {
    "id": 1,
    "title": "Dune: Part Two",
    "year": 2024,
    "description": "\"Dune: Part Two\" will explore the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a warpath of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, he endeavors to prevent a terrible future only he can foresee.",
    "genre": "Science Fiction",
    "rating": 8.6,
    "duration": 166,
    "director": "Denis Villeneuve",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2024/09/Mondodune8.jpg"
  },
  {
    "id": 2,
    "title": "Oppenheimer",
    "year": 2023,
    "description": "During World War II, Lt. Gen. Leslie Groves Jr. appoints physicist J. Robert Oppenheimer to work on the top-secret Manhattan Project. Oppenheimer and a team of scientists spend years developing and designing the atomic bomb. Their work comes to fruition on July 16, 1945, as they witness the world's first nuclear explosion, forever changing the course of history.",
    "genre": "Biography",
    "rating": 8.9,
    "duration": 180,
    "director": "Christopher Nolan",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2023/06/Oppenheimer3.jpg"
  },
  {
    "id": 3,
    "title": "Barbie",
    "year": 2023,
    "description": "To live in Barbie Land is to be a perfect being in a perfect place. Unless you have a full-on existential crisis. Or you're a Ken.",
    "genre": "Comedy",
    "rating": 7.0,
    "duration": 114,
    "director": "Greta Gerwig",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2024/01/Barbie8.jpg"
  },
  {
    "id": 4,
    "title": "Poor Things",
    "year": 2023,
    "description": "From filmmaker Yorgos Lanthimos and producer Emma Stone comes the incredible tale and fantastical evolution of Bella Baxter (Stone), a young woman brought back to life by the brilliant and unorthodox scientist Dr. Godwin Baxter (Willem Dafoe). Under Baxter's protection, Bella is eager to learn. Hungry for the worldliness she is lacking, Bella runs off with Duncan Wedderburn (Mark Ruffalo), a slick and debauched lawyer, on a whirlwind adventure across the continents. Free from the prejudices of her times, Bella grows steadfast in her purpose to stand for equality and liberation.",
    "genre": "Drama",
    "rating": 8.2,
    "duration": 141,
    "director": "Yorgos Lanthimos",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2023/09/Poorthings1.jpg"
  },
  {
    "id": 5,
    "title": "Killers of the Flower Moon",
    "year": 2023,
    "description": "Based on David Grann's broadly lauded best-selling book, \"Killers of the Flower Moon\" is set in 1920s Oklahoma and depicts the serial murder of members of the oil-wealthy Osage Nation, a string of brutal crimes that came to be known as the Reign of Terror.",
    "genre": "Crime",
    "rating": 8.0,
    "duration": 206,
    "director": "Martin Scorsese",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2023/11/Killersoftheflowermoon4.jpg"
  },
  {
    "id": 6,
    "title": "The Marvels",
    "year": 2023,
    "description": "Carol Danvers aka Captain Marvel has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Carol shouldering the burden of a destabilized universe. When her duties send her to an anomalous wormhole linked to a Kree revolutionary, her powers become entangled with that of Jersey City super-fan, Kamala Khan aka Ms. Marvel, and Carol's estranged niece, now S.A.B.E.R. astronaut Captain Monica Rambeau. Together, this unlikely trio must team-up and learn to work in concert to save the universe as \"The Marvels.\"",
    "genre": "Action",
    "rating": 6.2,
    "duration": 105,
    "director": "Nia DaCosta",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2023/04/Marvels1.jpg"
  },
  {
    "id": 7,
    "title": "Napoleon",
    "year": 2023,
    "description": "\"Napoleon\" is a spectacle-filled action epic that details the checkered rise and fall of the iconic French Emperor Napoleon Bonaparte, played by Oscar winner Joaquin Phoenix. Against a stunning backdrop of large-scale filmmaking orchestrated by legendary director Ridley Scott, the film captures Bonaparte's relentless journey to power through the prism of his addictive, volatile relationship with his one true love, Josephine, showcasing his visionary military and political tactics against some of the most dynamic practical battle sequences ever filmed.",
    "genre": "Historical",
    "rating": 6.9,
    "duration": 158,
    "director": "Ridley Scott",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2023/11/Napoleon3.jpg"
  },
  {
    "id": 8,
    "title": "Wonka",
    "year": 2023,
    "description": "Based on the extraordinary character at the center of Charlie and the Chocolate Factory, Roald Dahl’s most iconic children's book and one of the best-selling children's books of all time, \"Wonka\" tells the wondrous story of how the world's greatest inventor, magician and chocolate-maker became the beloved Willy Wonka we know today.",
    "genre": "Fantasy",
    "rating": 7.2,
    "duration": 116,
    "director": "Paul King",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2024/01/Wonka2.jpg"
  },
  {
    "id": 9,
    "title": "The Hunger Games: The Ballad of Songbirds & Snakes",
    "year": 2023,
    "description": "Experience the story of THE HUNGER GAMES -- 64 years before Katniss Everdeen volunteered as tribute, and decades before Coriolanus Snow became the tyrannical President of Panem. THE HUNGER GAMES: THE BALLAD OF SONGBIRDS & SNAKES follows a young Coriolanus (Tom Blyth) who is the last hope for his failing lineage, the once-proud Snow family that has fallen from grace in a post-war Capitol. With his livelihood threatened, Snow is reluctantly assigned to mentor Lucy Gray Baird (Rachel Zegler), a tribute from the impoverished District 12. But after Lucy Gray's charm captivates the audience of Panem, Snow sees an opportunity to shift their fates. With everything he has worked for hanging in the balance, Snow unites with Lucy Gray to turn the odds in their favor. Battling his instincts for both good and evil, Snow sets out on a race against time to survive and reveal if he will ultimately become a songbird or a snake.",
    "genre": "Adventure",
    "rating": 7.1,
    "duration": 157,
    "director": "Francis Lawrence",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2023/11/Hungergames20231.jpg"
  },
  {
    "id": 10,
    "title": "Inside Out 2",
    "year": 2024,
    "description": "The little voices inside Riley's head know her inside and out--but next summer, everything changes when Disney and Pixar's Inside Out 2 introduces a new Emotion: Anxiety.",
    "genre": "Animation",
    "rating": 7.8,
    "duration": 96,
    "director": "Kelsey Mann",
    "posterUrl": "https://www.moviepostersgallery.com/wp-content/uploads/2024/01/Insideout21.jpg"
  }
]
